app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaaaa"], ["user_id", 2], ["book_id", 5], ["created_at", "2021-10-05 06:42:03.856019"], ["updated_at", "2021-10-05 06:42:03.856019"]]
---
  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id
    if @book_comment.save

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 37]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
---
  def destroy
    BookComment.find_by(id: params[:id]).destroy